renesas/rx-driver-package/source/r_ble_da14531_rx/r_ble_da14531_rx_vx.xx/r_ble_da14531_rx/src/rm_ble_abs_api.h
    /** Import local identity address, keys information to local storage.
     * @par Implemented as
     * - RM_BLE_ABS_ImportKeyInformation()
     * @param[in]  p_ctrl       Pointer to control structure.
     * @param[in]  p_local_identity_address Pointer to local identiry address.
     * @param[in]  uint8_t  p_local_irk Pointer to local IRK (Identity Resolving Key)
     * @param[in]  uint8_t  p_local_csrk    Pointer to local CSRK
     */
    fsp_err_t (* importKeyInformation)(ble_abs_ctrl_t * const p_ctrl, ble_device_address_t * p_local_identity_address,
                                       uint8_t * p_local_irk, uint8_t * p_local_csrk);

    /** Export local identity address, keys information from local storage.
     * @par Implemented as
     * - RM_BLE_ABS_ExportKeyInformation()
     * @param[in]   p_ctrl       Pointer to control structure.
     * @param[out]  p_local_identity_address Pointer to local identiry address.
     * @param[out]  uint8_t  p_local_irk Pointer to local IRK (Identity Resolving Key)
     * @param[out]  uint8_t  p_local_csrk    Pointer to local CSRK
     */
    fsp_err_t (* exportKeyInformation)(ble_abs_ctrl_t * const p_ctrl, ble_device_address_t * p_local_identity_address,
                                       uint8_t * p_local_irk, uint8_t * p_local_csrk);
} ble_abs_api_t;

/** This structure encompasses everything that is needed to use an instance of this interface. */
typedef struct st_ble_abs_instance
{
    ble_abs_ctrl_t      * p_ctrl;      ///< Pointer to the control structure for this instance
    ble_abs_cfg_t const * p_cfg;       ///< Pointer to the configuration structure for this instance
    ble_abs_api_t const * p_api;       ///< Pointer to the API structure for this instance
} ble_abs_instance_t;

/*******************************************************************************************************************//**
 * @} (end addtogroup BLE_ABS_API)
 **********************************************************************************************************************/

/* Common macro for FSP header files. There is also a corresponding FSP_HEADER macro at the top of this file. */
FSP_FOOTER

#endif
